In [1]:
import pandas as pd

In [2]:
#Lista
data = [['juan',25],['maria',30],['pedro',40]]
print(type(data))

<class 'list'>

In [3]:
df = pd.DataFrame(data,columns=['Nombre','Edad'])

In [4]:
df

  Nombre  Edad
0   juan    25
1  maria    30
2  pedro    40

In [5]:
# Diccionario
data = {'Nombre': ['juan','maria','pedro'],
        'Edad':[25,30,40]
       }
print(type(data))

<class 'dict'>

In [6]:
df = pd.DataFrame(data)

In [7]:
df

  Nombre  Edad
0   juan    25
1  maria    30
2  pedro    40

In [8]:
# Lista de Tuplas
data = [('Juan',25),('maria',30),('pedro',40)]

In [10]:
df = pd.DataFrame(data, columns=['Nombre','Edad'])

In [11]:
df

  Nombre  Edad
0   Juan    25
1  maria    30
2  pedro    40

In [13]:
df = pd.read_csv('../data/data' , sep = '|')

In [14]:
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [15]:
# Lectura normal con el delimitador coma
df = pd.read_csv('../data/data.csv')

In [16]:
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [4]:
df = pd.read_csv('../data/data_without_header', header = None , names = ['Nombre','edad','ciudad'])

In [5]:
df

  Nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [6]:
#Leyendo Json
df = pd.read_json('../data/data.json')

In [7]:
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [10]:
df['nombre']

0     Juan
1    María
2    Pedro
Name: nombre, dtype: object

In [13]:
df[['nombre','edad']]

  nombre  edad
0   Juan    25
1  María    30
2  Pedro    35

In [14]:
df.loc[0]['edad']

25

In [15]:
data = {
    'grupo': ['A','B','A','B','A','B'],
    'valor': [10,15,25,12,27,33]
}
df = pd.DataFrame(data)

In [16]:
df

  grupo  valor
0     A     10
1     B     15
2     A     25
3     B     12
4     A     27
5     B     33

In [17]:
df.groupby('grupo').mean()

           valor
grupo
A      20.666667
B      20.000000

In [18]:
df.groupby('grupo').sum()

       valor
grupo
A         62
B         60

In [2]:
import numpy as np

In [4]:
data = {
    'A': [1,2,None,4],
    'B': [4,None,5,7]
}
df = pd.DataFrame(data)

In [5]:
df

     A    B
0  1.0  4.0
1  2.0  NaN
2  NaN  5.0
3  4.0  7.0

In [6]:
#Rellena con 0
df_lleno = df.fillna(value=0)
df_lleno

     A    B
0  1.0  4.0
1  2.0  0.0
2  0.0  5.0
3  4.0  7.0

In [7]:
# elimina filas
df_sin_nan = df.dropna()
df_sin_nan

     A    B
0  1.0  4.0
3  4.0  7.0

In [8]:
def suma(a,b):
    return a+b

In [9]:
# Creando columna
df['suma'] = df['A'] + df['B']
df

     A    B  suma
0  1.0  4.0   5.0
1  2.0  NaN   NaN
2  NaN  5.0   NaN
3  4.0  7.0  11.0

In [10]:
df['dobleA'] = df['A'].apply(lambda x: x*2)
df

     A    B  suma  dobleA
0  1.0  4.0   5.0     2.0
1  2.0  NaN   NaN     4.0
2  NaN  5.0   NaN     NaN
3  4.0  7.0  11.0     8.0

In [ ]:
#Usando lambda con una funcion
df['Sumando'] = df['B']